# EDUNET FOUNDATION - Self-Practice Exercise Notebook

# LAB 7- Python Connection with Database

Problem 1 create a table named EMPLOYEE in MySQL with five columns namely, FIRST_NAME,AGE, SEX and, INCOME.

In [19]:
import mysql.connector

mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database = "test"
)

cursor = mydb.cursor()

create_table_sql = """CREATE TABLE IF NOT EXISTS EMPLOYEE (
                        FIRST_NAME VARCHAR(50),
                        AGE INT(10),
                        SEX VARCHAR(5),
                        INCOME FLOAT(10,2)
                    )"""
cursor.execute(create_table_sql)

insert_data_sql = """INSERT INTO EMPLOYEE (FIRST_NAME, AGE, SEX, INCOME) 
                     VALUES (%s, %s, %s, %s)"""
data = [('THENNARASU', 19, 'MALE', 1500.00),
        ('RAHUL', 21, 'MALE', 2000.50),
        ('SIVA', 20, 'MALE', 4000.00)]

cursor.executemany(insert_data_sql, data)

Problem 2: Display created table using SELECT

In [20]:
select_query = "SELECT * FROM EMPLOYEE"
cursor.execute(select_query)
results = cursor.fetchall()
for row in results:
    print(row)

('THENNARASU', 19, 'MALE', 1500.0)
('RAHUL', 21, 'MALE', 2000.5)
('SIVA', 20, 'MALE', 4000.0)

Problem 3:Write a MySQL statement which retrieves the records of the employees whose income is greater than 4000.

In [21]:
select_query = "SELECT * FROM EMPLOYEE WHERE INCOME < 4000"
cursor.execute(select_query)
results = cursor.fetchall()
for row in results:
    print(row)
mydb.commit()
mydb.close()

('THENNARASU', 19, 'MALE', 1500.0)
('RAHUL', 21, 'MALE', 2000.5)